# Data integration

## Concatenation

In [1]:

import pandas as pd

In [2]:
df1 = pd.DataFrame(
    {"acc":[1,2,3] ,"name":[0,9,8] , "age":[2,4,6]}
)


df2 = pd.DataFrame(
    {"acc":[5,9,10] ,"loan":[45,55,8] , 
    }
)

In [3]:
df1

   acc  name  age
0    1     0    2
1    2     9    4
2    3     8    6

In [4]:
df2

   acc  loan
0    5    45
1    9    55
2   10     8

In [5]:
row_concat = pd.concat([df1,df2],axis=0)

In [6]:
row_concat

   acc  name  age  loan
0    1   0.0  2.0   NaN
1    2   9.0  4.0   NaN
2    3   8.0  6.0   NaN
0    5   NaN  NaN  45.0
1    9   NaN  NaN  55.0
2   10   NaN  NaN   8.0

In [7]:

column_concat = pd.concat([df1,df2],axis=1)

In [8]:
column_concat

   acc  name  age  acc  loan
0    1     0    2    5    45
1    2     9    4    9    55
2    3     8    6   10     8

## merge

In [19]:
df3 = pd.DataFrame(
    {"key":["A","B","C","D"] ,"id":[0,9,8,7] , "ac":[2,4,6,9]}
)

In [26]:
df4 = pd.DataFrame(
    {"key":["E","B","G","A"] ,"name":[0,9,8,7] , "ac":[2,4,6,9]}
)

In [27]:
df3

  key  id  ac
0   A   0   2
1   B   9   4
2   C   8   6
3   D   7   9

In [28]:
df4

  key  name  ac
0   E     0   2
1   B     9   4
2   G     8   6
3   A     7   9

In [29]:
pd.merge(df3,df4,how="inner",on="key",suffixes=("_df1","_df2"))

  key  id  ac_df1  name  ac_df2
0   A   0       2     7       9
1   B   9       4     9       4

In [30]:
pd.merge(df3,df4,how="outer",on="key",suffixes=("_df1","_df2"))

  key   id  ac_df1  name  ac_df2
0   A  0.0     2.0   7.0     9.0
1   B  9.0     4.0   9.0     4.0
2   C  8.0     6.0   NaN     NaN
3   D  7.0     9.0   NaN     NaN
4   E  NaN     NaN   0.0     2.0
5   G  NaN     NaN   8.0     6.0

In [31]:
pd.merge(df3,df4,how="left",on="key",suffixes=("_df1","_df2"))

  key  id  ac_df1  name  ac_df2
0   A   0       2   7.0     9.0
1   B   9       4   9.0     4.0
2   C   8       6   NaN     NaN
3   D   7       9   NaN     NaN

In [32]:
pd.merge(df3,df4,how="right",on="key",suffixes=("_df1","_df2"))

  key   id  ac_df1  name  ac_df2
0   E  NaN     NaN     0       2
1   B  9.0     4.0     9       4
2   G  NaN     NaN     8       6
3   A  0.0     2.0     7       9

In [35]:
#merge with df
df3.merge(df4,how="inner",on="key")

  key  id  ac_x  name  ac_y
0   A   0     2     7     9
1   B   9     4     9     4

# joining